app/mailers/request_mailer.rb

    def to_user_interesting
        @user = User.find(params[:user])
        @request = Request.find(params[:request])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 28], ["LIMIT", 1]]

    def to_donor_with_same_type
        @user = User.find(params[:user])
        @request = Request.find(params[:request])
        @donor = Donor.find(params[:donor])
        @url  = "http://savelifee.herokuapp.com/request/#{@request.id}"
        mail(
            to: @user.email,
            subject: 'Pedido de Doação'
          )
        NotificationDonorToRequest.create(request_id: @request.id, donor_id: @donor.id, status: "Enviada")
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
SELECT "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "notification_donor_to_requests" ("request_id", "donor_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["request_id", 40], ["donor_id", 2], ["status", "Enviada"], ["created_at", "2021-09-10 11:03:28.378905"], ["updated_at", "2021-09-10 11:03:28.378905"]]