app/controllers/api/v1/answers_requests_controller.rb

  def create
    @api_v1_answers_request = AnswersRequest.new(api_v1_answers_request_params)
    if @api_v1_answers_request.save
---
INSERT INTO "answers_requests" ("request_id", "donor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["request_id", 56], ["donor_id", 2], ["created_at", "2021-09-16 23:28:13.926040"], ["updated_at", "2021-09-16 23:28:13.926040"]]

    def set_api_v1_answers_request
      @api_v1_answers_request = AnswersRequest.find(params[:id])
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "answers_requests".* FROM "answers_requests" WHERE "answers_requests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def check_token
      begin
        token = Base64.decode64(params[:token])
        if(Request.exists?(id: params[:request_id]))
          user_id = Request.find_by(id: params[:request_id]).user_id
          if(User.find_by(id: user_id).authentication_token != token || !(SessionUser.exists?(token: token)))
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 47], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT 1 AS one FROM "session_users" WHERE "session_users"."token" = ? LIMIT ?  [["token", "7zhrcHyfHiAHF8NLwyje"], ["LIMIT", 1]]

    def check_token_create
      begin
        token = Base64.decode64(params[:token])
        if(Request.exists?(id: params[:answers_request][:request_id]) && Donor.exists?(id: params[:answers_request][:donor_id]) )
          user_id = Donor.find_by(id: params[:answers_request][:donor_id]).user_id
          if(User.find_by(id: user_id).authentication_token != token || !(SessionUser.exists?(token: token)))
---
SELECT "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "session_users" WHERE "session_users"."token" = ? LIMIT ?  [["token", "4cu-2ZKyNx8tBs3umfK4"], ["LIMIT", 1]]