app/controllers/api/v1/donors_controller.rb

  def update
    @api_v1_donor.authentication_token=params[:token]
    if @api_v1_donor.update(api_v1_donor_params)
---
UPDATE "donors" SET "birthdate" = ?, "weight" = ?, "blood" = ?, "gender" = ?, "updated_at" = ? WHERE "donors"."id" = ?  [["birthdate", "1999-12-12"], ["weight", 80.0], ["blood", "A "], ["gender", "femenino"], ["updated_at", "2021-09-07 15:44:58.609799"], ["id", 1]]