app/controllers/api/v1/donors_controller.rb

  def create

    @api_v1_donor = Donor.new(api_v1_donor_params)
    @api_v1_donor.status = 0
    if(Donor.exists?(user_id: @api_v1_donor.user_id))
      return json_response("Erro",false,["Este utilizador já é Dador"],{},model_name, :ok)
    end

    if @api_v1_donor.save
      u= User.find_by(id: @api_v1_donor.user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def set_api_v1_donor
      donors = Donor.select('donors.*,users.id, users.name, users.email, users.phone, users.type_user').joins(:user)
      if donors.exists?(params[:id])
        @api_v1_donor = donors.find(params[:id])
        @donor = Donor.find_by(id: params[:id])
        @api_v1_user = User.find_by(id: @api_v1_donor.user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def check_token
      token = Base64.decode64(params[:token])
      user_id = @api_v1_user.id
      if(User.exists?(id: user_id))
        if(User.find_by(id: user_id).authentication_token !=token || !(SessionUser.exists?(token: token)))
---
SELECT 1 AS one FROM "session_users" WHERE "session_users"."token" = ? LIMIT ?  [["token", "KKXEc8xtdKzpr3XuUj8y"], ["LIMIT", 1]]