app/controllers/api/v1/donors_controller.rb

SELECT COUNT(count_column) FROM (SELECT donors.*, users.name, users.email, users.phone, users.type_user AS count_column FROM "users" INNER JOIN "donors" ON "donors"."user_id" = "users"."id" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 20], ["OFFSET", 0]]
SELECT donors.*, users.name, users.email, users.phone, users.type_user FROM "users" INNER JOIN "donors" ON "donors"."user_id" = "users"."id" LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    p = params[:page]
    page = (p)?(p):1
    #@api_v1_donors = User.find_by_sql("SELECT donors.*, users.name, users.email, users.phone, users.type_user FROM donors INNER JOIN users ON users.id = donors.user_id").page(page).per(20)
    @api_v1_donors= User.select('donors.*, users.name, users.email, users.phone, users.type_user').joins(:donor).page(p).per(20)

    render json: { donors: @api_v1_donors,page: page , per_page: 20, user_count: @api_v1_donors.count, success: true}, status: :ok

UPDATE "donors" SET "birthdate" = ?, "weight" = ?, "blood" = ?, "gender" = ?, "updated_at" = ? WHERE "donors"."id" = ?  [["birthdate", "1999-12-12"], ["weight", 80.0], ["blood", "A "], ["gender", "femenino"], ["updated_at", "2021-09-07 15:44:58.609799"], ["id", 1]]
UPDATE "users" SET "email" = ?, "name" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "ariclinis1@gmail.com"], ["name", "Chimbili"], ["phone", "934641875"], ["updated_at", "2021-09-07 16:01:36.274852"], ["id", 1]]
---
  def update_donor
    donor=@donor.update(api_v1_donor_params)
    user= @api_v1_user.update(user_params)

SELECT "donors".* FROM "donors"
SELECT 1 AS one FROM "users" WHERE "users"."email" = ? AND "users"."id" != ? LIMIT ?  [["email", "ariclinis@gmail.com"], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT donors.*,users.id, users.name, users.email, users.phone, users.type_user FROM "donors" INNER JOIN "users" ON "users"."id" = "donors"."user_id" WHERE "donors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_api_v1_donor
      donors = Donor.select('donors.*,users.id, users.name, users.email, users.phone, users.type_user').joins(:user)
      if donors.exists?(params[:id])
        @api_v1_donor = donors.find(params[:id])
        @donor = Donor.find_by(id: params[:id])
        @api_v1_user = User.find_by(id: @api_v1_donor.user_id)