app/controllers/api/v1/notifications_controller.rb

SELECT COUNT(count_column) FROM (SELECT notifications.* AS count_column FROM "requests" INNER JOIN "notifications" ON "notifications"."request_id" = "requests"."id" WHERE (notifications.user_id = '01a4cb28-209f-4441-b4a5-3e6ee8acb2c0' and notifications.status = 'Enviada') LIMIT $1) subquery_for_count  [["LIMIT", 10]]
---
    def index
        notifications = Request.select('notifications.*').joins(:Notifications).where('notifications.user_id = ? and notifications.status = ?', params[:user_id], "Enviada").limit(10)
        render json: { notifications: notifications,page: page , per_page: 10, notifications_count: notifications.count, success: true, message: "Listado com sucesso"}, status: :ok