app/controllers/api/v1/PasswordResetsController.rb

    def edit_pass
      # finds user with a valid token
      token_decripted = Devise.token_generator.digest(User,:reset_password_token, params[:token])
      @user = User.find_by!(reset_password_token: token_decripted)
      @user = User.find_signed!(params[:token], purpose: 'password_reset')
---
SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = ? ORDER BY "users"."id" ASC LIMIT ?  [["reset_password_token", "7a86ed431422764f64c8a6ae3750637a31fb731a543bf6a8f71f79c432a7babf"], ["LIMIT", 1]]

    def forgot_password
      user = User.find_by_email(params[:email])
      if user.present?
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ariclinis1@gmail.com"], ["LIMIT", 1]]

    def update_pass
        # updates user's password
        token_decripted = Devise.token_generator.digest(User,:reset_password_token, params[:token])
        @user = User.find_by!(reset_password_token: token_decripted)
        if @user.update(password_params)
---
SELECT "users".* FROM "users" WHERE "users"."reset_password_token" = ? LIMIT ?  [["reset_password_token", "84c0dec14c571ff17679e8491ee6f2f998851b87883e6323958534cb7c64a552"], ["LIMIT", 1]]
UPDATE "users" SET "encrypted_password" = ?, "reset_password_token" = ?, "reset_password_sent_at" = ?, "updated_at" = ? WHERE "users"."id" = ?