app/controllers/api/v1/public_controller.rb

    def index_donors
        province = (params[:province])
        blood = (params[:blood])
        gender = (params[:gender])
        p = params[:page]
        page = (p)?(p):1
        @api_v1_donors = User.select('donors.*, users.name, users.email, users.phone, users.type_user').joins(:donor)
        if params[:province]
            @api_v1_donors = @api_v1_donors.where("province = ?",province )
        end
        if params[:blood]
            @api_v1_donors = @api_v1_donors.where("blood = ?",blood )
        end
        if params[:gender]
            @api_v1_donors = @api_v1_donors.where("gender = ?",gender )
        end
        c=0
        @api_v1_donors.each do |e|
           c=c+1
        end
        @api_v1_donors = @api_v1_donors.page(p).per(10)
---
SELECT "donors".* FROM "donors"
SELECT COUNT(*) FROM "donors"
SELECT COUNT(count_column) FROM (SELECT donors.*, users.name, users.email, users.phone, users.type_user AS count_column FROM "users" INNER JOIN "donors" ON "donors"."user_id" = "users"."id" WHERE (province = 'Namibe') AND (blood = 'A-') LIMIT $1 OFFSET $2) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]
SELECT donors.*, users.name, users.email, users.phone, users.type_user FROM "users" INNER JOIN "donors" ON "donors"."user_id" = "users"."id" WHERE (province = 'Namibe') AND (blood = 'A-') LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]