app/controllers/api/v1/registrations_controller.rb

    def create
      user = User.new user_params
      if user.save
        user.authentication_token = Base64.encode64(user.authentication_token)
        if !SessionUser.exists?(token: user.authentication_token)
          SessionUser.create(token: user.authentication_token)
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "authentication_token", "phone", "type_user", "name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
SELECT 1 AS one FROM "session_users" WHERE "session_users"."token" = $1 LIMIT $2  [["token", "yJQ9c96ASjpdb3CKy7o1"], ["LIMIT", 1]]
INSERT INTO "session_users" ("token", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["token", "yJQ9c96ASjpdb3CKy7o1"], ["created_at", "2021-09-17 15:32:00.082304"], ["updated_at", "2021-09-17 15:32:00.082304"]]

    def create_donor
        user = User.new user_params
        if user.save
            donor = Donor.new donor_params
            donor.status = 0
            donor.user_id = user.id
            if(donor.save)
                user.authentication_token = Base64.encode64(user.authentication_token)
                if !SessionUser.exists?(token: user.authentication_token)
                  SessionUser.create(token: user.authentication_token)
                end
                render json: {
                    messages: "Sign Up Successfully Donor",
                    is_success: true,
                    error_messages: {},
                    data: {User: user, Donor: donor}
                }, status: :ok
            else
                user.destroy
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "authentication_token", "phone", "type_user", "name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "donors" ("user_id", "birthdate", "weight", "blood", "status", "province", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]