app/controllers/api/v1/requests_controller.rb

SELECT COUNT(*) FROM (SELECT 1 AS one FROM "requests" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 20], ["OFFSET", 0]]
SELECT "requests".* FROM "requests" LIMIT ? OFFSET ?  [["LIMIT", 20], ["OFFSET", 0]]
---
  def index
    p = params[:page]
    page = (p)?(p):1
    @api_v1_requests = Request.page(page).per(20)
    render json: { requests: @api_v1_requests,page: page , per_page: 20, request_count: @api_v1_requests.count, success: true, message: "Listado com sucesso"}, status: :ok

INSERT INTO "requests" ("user_id", "type_request", "description", "province", "date_limit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @api_v1_request = Request.new(api_v1_request_params)
    type_r = params['type_request']
    type_r = type_r.to_i
    @api_v1_request.type_request = type_r

    if @api_v1_request.save