app/controllers/api/v1/requests_controller.rb

  def index
    p = params[:page]
    page = (p)?(p):1
    @api_v1_requests = Request.page(page).per(10)
    render json: { requests: @api_v1_requests,page: page , per_page: 10, request_count: @api_v1_requests.count, success: true, message: "Listado com sucesso"}, status: :ok
---
SELECT "requests".* FROM "requests" LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "requests" LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]

  def requests_user
    p = params[:page]
    page = (p)?(p):1
    @api_v1_requests = Request.page(page).per(10).where(["user_id = ?", params[:user_id]])
    render json: { requests: @api_v1_requests,page: page , per_page: 10, request_count: @api_v1_requests.count, success: true, message: "Listado com sucesso"}, status: :ok
---
SELECT "requests".* FROM "requests" WHERE (user_id = '1000') LIMIT ? OFFSET ?  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "requests" WHERE (user_id = '1') LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "requests" WHERE (user_id = '1000') LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 10], ["OFFSET", 0]]

  def create
    @api_v1_request = Request.new(api_v1_request_params)
    type_r = params['type_request']
    type_r = type_r.to_i
    @api_v1_request.type_request = type_r

    if @api_v1_request.save
---
INSERT INTO "requests" ("user_id", "type_request", "description", "province", "date_limit", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    if @api_v1_request != nil
      @api_v1_request.destroy
---
DELETE FROM "requests" WHERE "requests"."id" = ?  [["id", 40]]

    def set_api_v1_request
      if Request.exists?(id: params[:id])
        @api_v1_request = Request.find(params[:id])
---
SELECT "requests".* FROM "requests" WHERE "requests"."id" = ? LIMIT ?  [["id", 56], ["LIMIT", 1]]

    def check_token
      token = Base64.decode64(params[:token])
      user_id = params[:user_id]
      if(User.exists?(id: user_id))
        if(User.find_by(id: user_id).authentication_token !=token || !(SessionUser.exists?(token: token)))
---
SELECT 1 AS one FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "01a4cb28-209f-4441-b4a5-3e6ee8acb2c0"], ["LIMIT", 1]]
SELECT 1 AS one FROM "session_users" WHERE "session_users"."token" = $1 LIMIT $2  [["token", "mEYStGWFz_skKy-DU1qx"], ["LIMIT", 1]]