app/controllers/api/v1/sessions_controller.rb

    def create
      if(@user)
        if @user.valid_password?(sign_in_params[:password])
          #sign_in "user", @user
          if !SessionUser.exists?(token: @user.authentication_token)
            SessionUser.create(token: @user.authentication_token)
          end
          @user.authentication_token = Base64.encode64(@user.authentication_token)
          if Donor.exists?(user_id: @user.id)
            donor= Donor.find_by(user_id: @user.id)
---
SELECT 1 AS one FROM "session_users" WHERE "session_users"."token" = ? LIMIT ?  [["token", "KKXEc8xtdKzpr3XuUj8y"], ["LIMIT", 1]]
INSERT INTO "session_users" ("token", "created_at", "updated_at") VALUES (?, ?, ?)  [["token", "KKXEc8xtdKzpr3XuUj8y"], ["created_at", "2021-09-15 21:31:05.729410"], ["updated_at", "2021-09-15 21:31:05.729410"]]
SELECT "donors".* FROM "donors" WHERE "donors"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "donors" WHERE "donors"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]

    def destroy
      token = Base64.decode64(params["token"])
      if SessionUser.exists?(token: token)
        s = SessionUser.find_by(token: token)
        if s.destroy
---
SELECT "session_users".* FROM "session_users" WHERE "session_users"."token" = ? LIMIT ?  [["token", "KKXEc8xtdKzpr3XuUj8y"], ["LIMIT", 1]]
SELECT 1 AS one FROM "session_users" WHERE "session_users"."token" = $1 LIMIT $2  [["token", "R4mRiwXQ5ej5sXjoUTz1"], ["LIMIT", 1]]
SELECT "session_users".* FROM "session_users" WHERE "session_users"."token" = ? LIMIT ?  [["token", "4cu-2ZKyNx8tBs3umfK4"], ["LIMIT", 1]]
DELETE FROM "session_users" WHERE "session_users"."id" = ?  [["id", 7]]

    def load_user
      if(User.find_by(email: sign_in_params[:email]))
        @user = User.find_for_database_authentication(email: sign_in_params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "ariclinis1@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "ari@gmail.com"], ["LIMIT", 1]]