app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "a@gmail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "a@gmail.com"], ["LIMIT", 1]]
---
    def load_user
      if(User.find_by(email: sign_in_params[:email]))
        @user = User.find_for_database_authentication(email: sign_in_params[:email])