app/controllers/api/v1/users_controller.rb

    def update
        old_pass = params[:old_password]
        if params[:old_password] && !@api_v1_user.valid_password?(old_pass)
           return json_response("Erro",false,["Palavra Passe antiga errada"],{},model_name, :ok)
        end

        if !params[:old_password] && (params[:user][:password])
            return json_response("Erro",false,["É obrigatório a Palavra Passe Antiga"],{},model_name, :ok)
        end

        if params[:old_password] && (params[:old_password] == (params[:user][:password]))
            return json_response("Erro",false,["A nova Palavra-passe deve ser diferente da antiga"],{},model_name, :ok)
        end

        if @api_v1_user.update(user_params)
---
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$12$1PwEPef/A9jvUSyc905ETeCdNEBQmTsQPn7avj8Q62qdLmFDo7K2a"], ["updated_at", "2021-09-24 15:05:34.449439"], ["id", "a157382c-7472-4d7e-8148-2337faccdbe8"]]

    def set_api_v1_user
        if User.exists?(params[:id])
            @api_v1_user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", "a157382c-7472-4d7e-8148-2337faccdbe8"], ["LIMIT", 1]]

    def check_token
        begin
            token = Base64.decode64(params[:token])
            if (@api_v1_user.authentication_token != token || !(SessionUser.exists?(token: token)))
---
SELECT 1 AS one FROM "session_users" WHERE "session_users"."token" = $1 LIMIT $2  [["token", "s7wzdEZoswvmcUWezoKX"], ["LIMIT", 1]]