app/controllers/api/v1/users_controller.rb

    def check_token
        begin
            token = Base64.decode64(params[:token])
            if (@api_v1_user.authentication_token != token || !(SessionUser.exists?(token: token)))
---
SELECT 1 AS one FROM "session_users" WHERE "session_users"."token" = ? LIMIT ?  [["token", "x9WdhV56cDZVZMZgqzEu"], ["LIMIT", 1]]