app/controllers/dashboard_controller.rb

    def verification_token
        begin
            token = Base64.decode64(params[:token])
            if(!SessionUser.exists?(token: token))
---
SELECT "session_users".* FROM "session_users" WHERE "session_users"."token" = ? LIMIT ?  [["token", "KKXEc8xtdKzpr3XuUj8y"], ["LIMIT", 1]]
SELECT 1 AS one FROM "session_users" WHERE "session_users"."token" = ? LIMIT ?  [["token", "7zhrcHyfHiAHF8NLwyje"], ["LIMIT", 1]]